import { Link } from "react-router-dom";
import Footer from "../Components/Footer";
import Header from "../Components/Header";
import Leftbar from "../Components/Leftbar";

export default function Agreement(){

    window.scrollTo({ top: 0, behavior: 'smooth' });

    return(
        <div className="landing">
            <Header/>
            <div className="page-container">
                <div className="page">
                    <h2>اتفاقية استخدام موقع Bouira Computer Society</h2>
                    <span>تاريخ السريان: 24/11/2024</span>
                    <p>
                        مرحبًا بك في موقع BCS! باستخدامك لهذا <Link to="/">الموقع</Link> ، فإنك توافق على الالتزام بشروط وأحكام الاستخدام الموضحة أدناه. يرجى قراءة هذه الاتفاقية بعناية. إذا كنت لا توافق على أي من هذه الشروط، يرجى عدم استخدام الموقع.
                        </p>
                        <h3>1. تعريفات</h3>
                        <p>
                        "الموقع": يشير إلى موقع <Link to='/'>BCS</Link> الإلكتروني .
                        <br />
                        "المستخدم": يشير إلى أي شخص يقوم باستخدام الموقع أو تصفحه أو التسجيل فيه.
                        <br />
                        "المحتوى": يشير إلى كافة المعلومات والنصوص والصور ومقاطع الفيديو أو المواد الأخرى المتوفرة على الموقع.
                    </p>
                    <h3>2. قبول الشروط</h3>
                    <p>
                        باستخدامك للموقع، فإنك تقر وتوافق على الالتزام بهذه الاتفاقية. 
                        إذا كنت تستخدم الموقع نيابةً عن كيان (مثل شركة)، فإنك تضمن أنك مخول قانونيًا لإلزام هذا الكيان بهذه الشروط.
                    </p>
                    <h3>3. التعديلات على الاتفاقية</h3>
                    <p>
                        يحتفظ موقع BCS بالحق في تعديل أو تحديث هذه الاتفاقية في أي وقت دون إشعار مسبق.
                        <br />
                        سيتم نشر النسخة المحدثة على الموقع مع تحديث تاريخ السريان.
                        <br />
                        استمرارك في استخدام الموقع بعد أي تعديل يعني موافقتك على الشروط الجديدة.
                    </p>
                    <h3>4. حقوق الملكية الفكرية</h3>
                    <p>
                    جميع المحتويات الموجودة على الموقع (النصوص، الصور، الشعارات، التصميمات، البرمجيات) هي ملك لموقع <Link to="/#home">BCS</Link> أو الجهات المرخصة له ومحميّة بموجب قوانين حقوق الطبع والنشر.
                    لا يجوز نسخ أو إعادة توزيع أو نشر أي جزء من المحتوى دون إذن خطي مسبق.
                    </p>
                    <h3>5. استخدام الموقع</h3>
                    <p>
                        الأنشطة الممنوعة على موقع BCS
                        <ul>
                            <li>استخدام الموقع لأي غرض غير قانوني.</li>
                            <li>محاولة اختراق الموقع أو تعطيل وظائفه.</li>
                            <li>نسخ أو تعديل أو إعادة بيع المحتوى دون إذن.</li>
                        </ul>
                        يحق للموقع تعليق أو إنهاء حسابك إذا انتهكت أيًا من هذه الشروط.
                    </p>
                    <h3>6. الحسابات وكلمات المرور</h3>
                    <p>
                        <ul>
                            <li>عند إنشاء حساب على الموقع، يجب عليك تقديم معلومات دقيقة وكاملة.</li>
                            <li>تتحمل المسؤولية الكاملة عن الحفاظ على سرية معلومات تسجيل الدخول الخاصة بك.</li>
                            <li>أي نشاط يتم عبر حسابك يُعتبر مسؤوليتك الشخصية.</li>
                        </ul>
                    </p>
                    <h3>7. حدود المسؤولية</h3>
                    <p>
                        يتم تقديم الموقع "كما هو" دون أي ضمانات من أي نوع، صريحة أو ضمنية.
                        <br />
                        لا يتحمل الموقع المسؤولية عن أي أضرار مباشرة أو غير مباشرة ناتجة عن استخدام الموقع أو المحتوى.
                    </p>
                    <h3>8. الروابط لمواقع الطرف الثالث</h3>
                    <p>قد يحتوي الموقع على روابط لمواقع خارجية. نحن لسنا مسؤولين عن محتوى أو سياسات الخصوصية لتلك المواقع.
                        <br />
                        استخدامك لمواقع الطرف الثالث يخضع لشروط وأحكام تلك المواقع.
                    </p>
                    <h3>9. الخصوصية</h3>
                    <p>
                    يمكن للموقع إنهاء أو تعليق وصولك إلى الموقع في أي وقت، ولأي سبب، دون إشعار مسبق.
                    <br />
                    يحق لك أيضًا إنهاء استخدام الموقع بإغلاق حسابك.
                    </p>
                    <h3>10. إتصل بنا</h3>
                    <p>إذا كان لديك أي أسئلة أو مخاوف بشأن إتفاقية الإستخدام هذه، يرجى الاتصال بنا من خلال نموذج الإتصال بالصفحة الرئيسية.</p>
                    
                </div>
                <Leftbar/>
            </div>
            <Footer/>
        </div>
    )
}