import Header from "../Components/Header";
import Footer from "../Components/Footer";
import { Link } from "react-router-dom";
import Leftbar from "../Components/Leftbar";

export default function(){

    window.scrollTo({ top: 0, behavior: 'smooth' });

    return(
        <div className="landing">
            <Header/>
            <div className="page-container">
                <div className="page">
                    <h2>سياسة الخصوصية لموقع وتطبيق BCS</h2>
                    <span>آخر تحديث : 24/11/2024</span>
                    <h3>1.مقدمة</h3>
                    <p>مرحبًا في BCS، خصوصيتك مهمة لنا. توضح سياسة الخصوصية هذه كيفية جمعنا واستخدامنا والكشف عن المعلومات حول مستخدمي تطبيقنا وموقعنا. بإستخدام <Link to='https://play.google.com/store/apps/details?id=m.ify.computersciencebouira&hl=en' target="_blank">التطبيق</Link> أو <Link to="/" target="_blank">الموقع</Link>، أنت توافق على شروط سياسة الخصوصية هذه.</p>
                    <h3>2. المعلومات التي نجمعها</h3>
                    <h4>1.2. المعلومات التي تقدمها طوعا</h4>
                    <p>اسمك، بريدك الإلكتروني، (عند التسجيل أو التواصل معنا).</p>
                    <h4>2.2. المعلومات التي نجمعها تلقائيا</h4>
                    <p>
                        <ul>
                            <li>عنوان IP الخاص بك.</li>
                            <li>نوع الجهاز والمتصفح.</li>
                            <li>الصفحات التي تزورها ومدة بقائك عليها</li>
                            <li>ملفات تعريف الارتباط (Cookies) التي تساعدنا على تحسين تجربتك.</li>
                        </ul>
                    </p>
                    <h3>3. كيف نستخدم المعلومات</h3>
                    <p>
                        نحن نستخدم المعلومات السابقة المذكورة في ركن المعلومات التي نجمعها في :
                        <ul>
                            <li>إنشاء حساب المستخدم وتحسين تجربته </li>
                            <li>تخصيص المحتوى وتقديم خدمات ملائمة.</li>
                            <li>للرد على استفساراتك أو إرسال تحديثات مهمة.</li>
                            <li>لفهم كيفية استخدام الزوار للموقع وتطوير خدماتنا.</li>
                            <li>منع أي محاولات غير مصرح بها للوصول إلى الموقع.</li>
                        </ul>
                    </p>
                    <h3>4. مشاركة المعلومات مع أطراف ثالثة</h3>
                    <p>
                        نلتزم بعدم بيع أو تأجير بياناتك الشخصية. ومع ذلك، قد نشاركها مع:
                        <ul>
                            <li>مزودي الخدمات: مثل خدمات الدفع أو استضافة الموقع، بشرط الالتزام بحماية بياناتك.</li>
                            <li>الإعلانات: قد نستخدم أدوات مثل Google Analytics أو Facebook Pixel لجمع بيانات لأغراض التحليل أو التسويق.</li>
                            <li>السلطات القانونية: إذا طُلب منا بموجب القانون.</li>
                        </ul>
                    </p>
                    <h3>5. ملفات تعريف الارتباط (Cookies)</h3>
                    <p>
                        نستخدم ملفات تعريف الارتباط لتحسين تجربتك على الموقع. يمكنك إدارة إعدادات ملفات تعريف الارتباط من خلال إعدادات المتصفح الخاص بك.
                        <br />
                        أنواع ملفات تعريف الإرتباط
                        <ul>
                            <li>الضرورية: لتشغيل الموقع بشكل صحيح.</li>
                            <li>الأداء: لتحليل أداء الموقع.</li>
                            <li>الإعلانات: لعرض إعلانات مخصصة.</li>
                        </ul>
                    </p>
                    <h3>6. حماية بياناتك</h3>
                    <p>نتخذ تدابير تقنية قصوى لحماية بياناتك من الوصول غير المصرح به أو الفقدان. ومع ذلك، لا يمكن ضمان أمان 100% عند استخدام الإنترنت.</p>
                    <h3>7. حقوقك</h3>
                    <p>نظرا لعدم سماح التطبيق أو الموقع بحذف الحسابات، لك الحق في طلب حذف بياناتك كليا وذلك من خلال التوجه إلى ركن إتصل بنا وإرسال رسالة توضح فيها طلبك.</p>
                    <h3>8. روابط لأطراف ثالثة</h3>
                    <p>قد يحتوي موقعنا على روابط لمواقع أخرى. نحن لسنا مسؤولين عن سياسات الخصوصية لتلك المواقع، ونشجعك على مراجعتها.</p>
                    <h3>9. تحديثات سياسة الخصوصية</h3>
                    <p>نحتفظ بحق تعديل سياسة الخصوصية هذه في أي وقت. إذا قمنا بإجراء تغييرات جوهرية، سنقوم بإعلامك عن طريق تحديث تاريخ "آخر تحديث". يعتبر استمرار استخدامك للتطبيق بعد نشر التغييرات موافقة منك على تلك التغييرات.</p>
                    <h3>10. إتصل بنا</h3>
                    <p>إذا كان لديك أي أسئلة أو مخاوف بشأن سياسة الخصوصية هذه، يرجى الاتصال بنا من خلال نموذج الإتصال بالصفحة الرئيسية.</p>
                    <h3>11. الموافقة</h3>
                    <p>من خلال استخدامك لموقعنا وتطبيقنا، فإنك تقر بأنك قد قرأت وفهمت ووافقت على سياسة الخصوصية هذه.</p>
                </div>
                <Leftbar/>
            </div>
            <Footer/>
        </div>
    )
}